namespace BooksAPI.Model
{
    public static class DbSeeder
    {
        public static void Seed(IApplicationBuilder app)
        {
            using var scope = app.ApplicationServices.CreateScope();
            var context = scope.ServiceProvider.GetRequiredService<AppDbContext>();

            if (!context.Books.Any())
            {
                var books = new List<Book>
                {
                    new Book
                    {
                        Title ="رجال في الشمس",
                        Author = "غغسان كنفاني",
                        Description = "رواية رجال في الشمس تأليف غسان كنفاني .. هي الصراخ الشرعي المفقود، إنها الصوت الفلسطيني الذي ضاع طويلاً في خيام التشرد، والذي يختنق داخل عربة يقودها خصي هزم مرة أولى وسيقود الجميع إلى الموت. وهي كرواية لا تدعي التعبير عن الواقع الفلسطيني المعاش في علاقاته المتشابكة، إنها إطار رمزي لعلاقات متعددة تتمحور حول الموت الفلسطيني، وحول ضرورة الخروج منه باتجاه اكتشاف الفعل التاريخي أو البحث عن هذا الفعل انطلاقاً من طرح السؤال البديهي: \"لماذا لم يدقوا جدران الخزان.\"",
                        CoverUrl = "/Images/رجال في الشمس.jpg",
                        AudioUrl = "/Audio/غسان كنفاني - رجال في الشمس.m4a",
                        PDFUrl = "/PDFS/رواية رجال في الشمس.pdf"
                    },
                    new Book
                    {
                        Title ="السؤال الحائر",
                        Author = "مصطفى محمود",
                        Description = "يحتوي هذا الكتاب على عدة مقالات كتبها الكاتب الفيلسوف الأديب مصطفى محمود في عدة مواضيع مهمة يدور حولها تسأولات كثيرة في أذهان الجميع مثل موضوع الفن حلال أم حرام وإلى أين نسير ومن هو بوذا وماذا بعد الموت وليست هذه فقط هى المقالات تسألت أوردها هذا الكتاب فهو في يرد على هذه التساؤلات بصورة جيدة أدبية سهلة في حين أن الكثير من العلماء احتاروا في الإجابة عن هذه الأسئلة غير أنه أيضا يعرفنا ببوذا وبفرويد وبالأصوليين في مقدمة سريعة قبل المقال ثم يوضح وجهة نظره وبطريقة ساخرة يحلل الأمور سياسيا واجتماعيا وثقافيا.",
                        CoverUrl = "/Images/السؤال الحائر.jpg",
                        AudioUrl = "/Audio/السؤال الحائر.m4a",
                        PDFUrl = "/PDFS/السؤال الحائر.pdf"
                    },
                     new Book
                    {
                        Title ="رحلتي من الشك للإيمان",
                        Author = "مصطفى محمود",
                        Description = "كتاب رحلتي من الشك إلى الإيمان تأليف مصطفى محمود .. الانسان يولد وحده ويموت وحده ويصل إلى الحق وحده وليست مبلغة أن توصف الدنيا بأنها باطل الأباطيل الكل باطل وقبض الريح ، فكل ما حولنا من مظاهر الدنيا يتصف بالبطلان والزيف ونحن نقتل بعضنا بعضاً فى سبيل الغرور وإرضاء لكبرياء كاذب والدنيا ملهاة قبل أن تكون مأساة ، ومع ذلك نحن نتحرق شوقاً فى سبيل الحق ونموت سعداء فى سبيله والشعور بالحق يملؤنا تماماً وإن كنا نعجز عن الوصول إليه ، إننا نشعر به ملء القلب وإن كنا لا نراه حولنا وهذا الشعور الطاغى هو شهادة بوجوده ، إننا وإن لم نر الحق وإن لم نصل إليه وإن لم نبلغه فهو فينا وهو يحفزنا وهو مثال مطلق لا يغيب عن ضميرنا لحظة وبصائنا مفتوحة عليه دوماً .",
                        CoverUrl = "/Images/رحلتي من الشك إلى الأيمان.jpg",
                        AudioUrl = "/Audio/رحلتي من الشك للإيمان.m4a",
                        PDFUrl = "/PDFS/رحلتي من الشك إلى الإيمان.pdf"
                    },
                     new Book
                    {
                        Title ="العنكبوت",
                        Author = "مصطفى محمود",
                        Description = "إلى عالم الحياة الغامض تنتقل لنا هذه القصة البوليسية الغامضة والتي جاءت لتروي مشاهدات طبيب وأسرار عالم كيميائي استطاع بفضل ذكائه وحشريته أن يكتشف سر الحياة، وسر البقاء وحب الحياة، ولو على حساب أرواح الآخرين من البشر",
                        CoverUrl = "/Images/رواية_العنكبوت.jpg",
                        AudioUrl = "/Audio/رواية العنكبوت.m4a",
                        PDFUrl = "/PDFS/رواية العنكبوت.pdf"
                    },
                    new Book
                    {
                        Title ="إعلان عن جريمة",
                        Author = "أجاثا كريثتي",
                        Description = "رواية إعلان عن جريمة للكاتبة أجاثا كريستي من أشهر روايات الغموض والإثارة حيث تتميز بأسلوبها المشوق وأحداثها المليئة بالألغاز، فتجمع الرواية بين التشويق والتحليل الذكي مما يجعلها تجربة ممتعة لمحبي الأدب البوليسي، وبأسلوبها البسيط والمميز تأخذ القارئ في رحلة مثيرة مليئة بالمفاجآت والتحديات العقلية، وفي السطور القادمة سنعرض لكم ملخص كتاب إعلان عن جريمة.\r\n\r\nرواية إعلان عن جريمة هي واحدة من أشهر روايات الغموض التي كتبتها أجاثا كريستي وتتميز بأسلوبها المشوق والمليء بالألغاز.\r\n\r\nتدور القصة حول إعلان غريب يظهر في صحيفة محلية، مما يثير الفضول ويقود إلى جريمة غامضة تحتاج إلى حل، وتتولى الآنسة ماربل المحققة الذكية الكشف عن الحقيقة من خلال تحليل التفاصيل الدقيقة وربط الأحداث بطريقة مذهلة.\r\n\r\nالرواية تجمع بين الإثارة، الذكاء والتشويق، مما يجعلها من الأعمال التي يصعب التوقف عن قراءتها، فإذا كنت من محبي الأدب البوليسي والألغاز الذكية فهذه الرواية ستأخذك في رحلة ممتعة مليئة بالمفاجآت.",
                        CoverUrl = "/Images/إعلان_عن_جريمة.jpg",
                        AudioUrl = "/Audio/رواية اعلان عن جريمة.m4a",
                        PDFUrl = "/PDFS/إعلان عن جريمة.pdf"
                    },
                     new Book
                    {
                        Title ="فن الحياة",
                        Author = "سلامة موسى",
                        Description = "هل أنت سعيد؟ إن كانت الإجابة: نعم، فما هو مقدار سعادتك؟ وإن كانت الإجابة: لا، فكيف تغدو سعيدًا؟ يحيا الإنسان طوال حياته باحثًا عن السعادة، وقد تنتهى حياته ولا يَذْكُر لحظة كان بها سعيدًا، ربما هذا الشخص لم يقرأ «فن الحياة»؛ إنه كتاب يحتوي على المبادئ الأساسية للسعادة، وهو يعترف أن تحقيق السعادة له متطلبات؛ منها: أن يُحقق الإنسان الحد الأدنى من الحياة الكريمة. يستطيع الإنسان من هنا أن يسير نحو سعادته، وهي ليست سعادة المال الذي يسعى الكثير وراءه معتقدين أنه سبيلهم الوحيد لبلوغها. إن السعادة الحقيقية هي التخلص من عاداتنا السيئة، والاتجاه نحو القراءة والثقافة؛ تلك هي السعادة الحقيقية، سعادة الوجدان لا سعادة الحيوان.",
                        CoverUrl = "/Images/فن الحياة.jpg",
                        AudioUrl = "/Audio/فن الحياة.m4a",
                        PDFUrl = "/PDFS/فن_الحياة.pdf"
                    },
                       new Book
                    {
                        Title ="تهمة اليأس",
                        Author = "آرثور شوبنهاور",
                        Description="الخلود والانتحار، موقع المرأة وغريزة الرجل، السيكولوجيا البشرية ومعاناتها سعادتها في هذا العالم : هذه النصوص المنتقاة لا تحمل في طياتها صرامة الاطروحات الفلسفية البحتة التي كتبها شوبنهاور، وانما هي تشريح للعالم كما رآه شوبنهاور من عيون تلك الفلسفة البحتة, هي اسقاطات قناعاته على طريقة حياتنا الفاسدة , وتوجيه للطريقة التي ينبغي علينا أن نعيش من خلالها فكما يقول لنا: \"الحكمة النظرية التي لا تمارس مثل الوردة المزدوجة , تبهج الاخرين بألوانها وعطرها الجميل , لكنها تذوي وترحل بلا بذور\"",
                        CoverUrl = "/Images/تهمة اليأس.jpg",
                        AudioUrl = "/Audio/كتاب تهمة اليأس.m4a",
                        PDFUrl = "/PDFS/كتاب تهمة اليأس.pdf"
                    },

                };

                context.Books.AddRange(books);
                context.SaveChanges();
            }
        }
    }
}